jmestanza/labo-de-micros-tpf/audio/old_files/I2S+I2C(UDA1380)/old_files/Ejemplos/demo_i2s_2.x_for_release/demo_i2s/src/include/__MK60X256VMD100.h
/* CAU - Peripheral instance base addresses */
/*! Peripheral CAU base pointer */
#define CAU_BASE_PTR                             ((CAU_MemMapPtr)0xE0081000u)

/* ----------------------------------------------------------------------------
   -- CAU - Register accessor macros
   ---------------------------------------------------------------------------- */

/*! \addtogroup CAU_Register_Accessor_Macros CAU - Register accessor macros */
/*! \{ */


/* CAU - Register instance definitions */
/* CAU */
#define CAU_LDR_CASR                             CAU_LDR_CASR_REG(CAU_BASE_PTR)
#define CAU_LDR_CAA                              CAU_LDR_CAA_REG(CAU_BASE_PTR)
#define CAU_LDR_CA0                              CAU_LDR_CA_REG(CAU_BASE_PTR,0)
#define CAU_LDR_CA1                              CAU_LDR_CA_REG(CAU_BASE_PTR,1)
#define CAU_LDR_CA2                              CAU_LDR_CA_REG(CAU_BASE_PTR,2)
#define CAU_LDR_CA3                              CAU_LDR_CA_REG(CAU_BASE_PTR,3)
#define CAU_LDR_CA4                              CAU_LDR_CA_REG(CAU_BASE_PTR,4)
#define CAU_LDR_CA5                              CAU_LDR_CA_REG(CAU_BASE_PTR,5)
#define CAU_LDR_CA6                              CAU_LDR_CA_REG(CAU_BASE_PTR,6)
#define CAU_LDR_CA7                              CAU_LDR_CA_REG(CAU_BASE_PTR,7)
#define CAU_LDR_CA8                              CAU_LDR_CA_REG(CAU_BASE_PTR,8)
#define CAU_STR_CASR                             CAU_STR_CASR_REG(CAU_BASE_PTR)
#define CAU_STR_CAA                              CAU_STR_CAA_REG(CAU_BASE_PTR)
#define CAU_STR_CA0                              CAU_STR_CA_REG(CAU_BASE_PTR,0)
#define CAU_STR_CA1                              CAU_STR_CA_REG(CAU_BASE_PTR,1)
#define CAU_STR_CA2                              CAU_STR_CA_REG(CAU_BASE_PTR,2)
#define CAU_STR_CA3                              CAU_STR_CA_REG(CAU_BASE_PTR,3)
#define CAU_STR_CA4                              CAU_STR_CA_REG(CAU_BASE_PTR,4)
#define CAU_STR_CA5                              CAU_STR_CA_REG(CAU_BASE_PTR,5)
#define CAU_STR_CA6                              CAU_STR_CA_REG(CAU_BASE_PTR,6)
#define CAU_STR_CA7                              CAU_STR_CA_REG(CAU_BASE_PTR,7)
#define CAU_STR_CA8                              CAU_STR_CA_REG(CAU_BASE_PTR,8)
#define CAU_ADR_CASR                             CAU_ADR_CASR_REG(CAU_BASE_PTR)
#define CAU_ADR_CAA                              CAU_ADR_CAA_REG(CAU_BASE_PTR)
#define CAU_ADR_CA0                              CAU_ADR_CA_REG(CAU_BASE_PTR,0)
#define CAU_ADR_CA1                              CAU_ADR_CA_REG(CAU_BASE_PTR,1)
#define CAU_ADR_CA2                              CAU_ADR_CA_REG(CAU_BASE_PTR,2)
#define CAU_ADR_CA3                              CAU_ADR_CA_REG(CAU_BASE_PTR,3)
#define CAU_ADR_CA4                              CAU_ADR_CA_REG(CAU_BASE_PTR,4)
#define CAU_ADR_CA5                              CAU_ADR_CA_REG(CAU_BASE_PTR,5)
#define CAU_ADR_CA6                              CAU_ADR_CA_REG(CAU_BASE_PTR,6)
#define CAU_ADR_CA7                              CAU_ADR_CA_REG(CAU_BASE_PTR,7)
#define CAU_ADR_CA8                              CAU_ADR_CA_REG(CAU_BASE_PTR,8)
#define CAU_RADR_CASR                            CAU_RADR_CASR_REG(CAU_BASE_PTR)
#define CAU_RADR_CAA                             CAU_RADR_CAA_REG(CAU_BASE_PTR)
#define CAU_RADR_CA0                             CAU_RADR_CA_REG(CAU_BASE_PTR,0)
#define CAU_RADR_CA1                             CAU_RADR_CA_REG(CAU_BASE_PTR,1)
#define CAU_RADR_CA2                             CAU_RADR_CA_REG(CAU_BASE_PTR,2)
#define CAU_RADR_CA3                             CAU_RADR_CA_REG(CAU_BASE_PTR,3)
#define CAU_RADR_CA4                             CAU_RADR_CA_REG(CAU_BASE_PTR,4)
#define CAU_RADR_CA5                             CAU_RADR_CA_REG(CAU_BASE_PTR,5)
#define CAU_RADR_CA6                             CAU_RADR_CA_REG(CAU_BASE_PTR,6)
#define CAU_RADR_CA7                             CAU_RADR_CA_REG(CAU_BASE_PTR,7)
#define CAU_RADR_CA8                             CAU_RADR_CA_REG(CAU_BASE_PTR,8)
#define CAU_XOR_CASR                             CAU_XOR_CASR_REG(CAU_BASE_PTR)
#define CAU_XOR_CAA                              CAU_XOR_CAA_REG(CAU_BASE_PTR)
#define CAU_XOR_CA0                              CAU_XOR_CA_REG(CAU_BASE_PTR,0)
#define CAU_XOR_CA1                              CAU_XOR_CA_REG(CAU_BASE_PTR,1)
#define CAU_XOR_CA2                              CAU_XOR_CA_REG(CAU_BASE_PTR,2)
#define CAU_XOR_CA3                              CAU_XOR_CA_REG(CAU_BASE_PTR,3)
#define CAU_XOR_CA4                              CAU_XOR_CA_REG(CAU_BASE_PTR,4)
#define CAU_XOR_CA5                              CAU_XOR_CA_REG(CAU_BASE_PTR,5)
#define CAU_XOR_CA6                              CAU_XOR_CA_REG(CAU_BASE_PTR,6)
#define CAU_XOR_CA7                              CAU_XOR_CA_REG(CAU_BASE_PTR,7)
#define CAU_XOR_CA8                              CAU_XOR_CA_REG(CAU_BASE_PTR,8)
#define CAU_ROTL_CASR                            CAU_ROTL_CASR_REG(CAU_BASE_PTR)
#define CAU_ROTL_CAA                             CAU_ROTL_CAA_REG(CAU_BASE_PTR)
#define CAU_ROTL_CA0                             CAU_ROTL_CA_REG(CAU_BASE_PTR,0)
#define CAU_ROTL_CA1                             CAU_ROTL_CA_REG(CAU_BASE_PTR,1)
#define CAU_ROTL_CA2                             CAU_ROTL_CA_REG(CAU_BASE_PTR,2)
#define CAU_ROTL_CA3                             CAU_ROTL_CA_REG(CAU_BASE_PTR,3)
#define CAU_ROTL_CA4                             CAU_ROTL_CA_REG(CAU_BASE_PTR,4)
#define CAU_ROTL_CA5                             CAU_ROTL_CA_REG(CAU_BASE_PTR,5)
#define CAU_ROTL_CA6                             CAU_ROTL_CA_REG(CAU_BASE_PTR,6)
#define CAU_ROTL_CA7                             CAU_ROTL_CA_REG(CAU_BASE_PTR,7)
#define CAU_ROTL_CA8                             CAU_ROTL_CA_REG(CAU_BASE_PTR,8)
#define CAU_AESC_CASR                            CAU_AESC_CASR_REG(CAU_BASE_PTR)
#define CAU_AESC_CAA                             CAU_AESC_CAA_REG(CAU_BASE_PTR)
#define CAU_AESC_CA0                             CAU_AESC_CA_REG(CAU_BASE_PTR,0)
#define CAU_AESC_CA1                             CAU_AESC_CA_REG(CAU_BASE_PTR,1)
#define CAU_AESC_CA2                             CAU_AESC_CA_REG(CAU_BASE_PTR,2)
#define CAU_AESC_CA3                             CAU_AESC_CA_REG(CAU_BASE_PTR,3)
#define CAU_AESC_CA4                             CAU_AESC_CA_REG(CAU_BASE_PTR,4)
#define CAU_AESC_CA5                             CAU_AESC_CA_REG(CAU_BASE_PTR,5)
#define CAU_AESC_CA6                             CAU_AESC_CA_REG(CAU_BASE_PTR,6)
#define CAU_AESC_CA7                             CAU_AESC_CA_REG(CAU_BASE_PTR,7)
#define CAU_AESC_CA8                             CAU_AESC_CA_REG(CAU_BASE_PTR,8)
#define CAU_AESIC_CASR                           CAU_AESIC_CASR_REG(CAU_BASE_PTR)
#define CAU_AESIC_CAA                            CAU_AESIC_CAA_REG(CAU_BASE_PTR)
#define CAU_AESIC_CA0                            CAU_AESIC_CA_REG(CAU_BASE_PTR,0)
#define CAU_AESIC_CA1                            CAU_AESIC_CA_REG(CAU_BASE_PTR,1)
#define CAU_AESIC_CA2                            CAU_AESIC_CA_REG(CAU_BASE_PTR,2)
#define CAU_AESIC_CA3                            CAU_AESIC_CA_REG(CAU_BASE_PTR,3)
#define CAU_AESIC_CA4                            CAU_AESIC_CA_REG(CAU_BASE_PTR,4)
#define CAU_AESIC_CA5                            CAU_AESIC_CA_REG(CAU_BASE_PTR,5)
#define CAU_AESIC_CA6                            CAU_AESIC_CA_REG(CAU_BASE_PTR,6)
#define CAU_AESIC_CA7                            CAU_AESIC_CA_REG(CAU_BASE_PTR,7)
#define CAU_AESIC_CA8                            CAU_AESIC_CA_REG(CAU_BASE_PTR,8)
#define CAU_DIRECT0                              CAU_DIRECT_REG(CAU_BASE_PTR,0)
#define CAU_DIRECT1                              CAU_DIRECT_REG(CAU_BASE_PTR,1)
#define CAU_DIRECT2                              CAU_DIRECT_REG(CAU_BASE_PTR,2)
#define CAU_DIRECT3                              CAU_DIRECT_REG(CAU_BASE_PTR,3)
#define CAU_DIRECT4                              CAU_DIRECT_REG(CAU_BASE_PTR,4)
#define CAU_DIRECT5                              CAU_DIRECT_REG(CAU_BASE_PTR,5)
#define CAU_DIRECT6                              CAU_DIRECT_REG(CAU_BASE_PTR,6)
#define CAU_DIRECT7                              CAU_DIRECT_REG(CAU_BASE_PTR,7)
#define CAU_DIRECT8                              CAU_DIRECT_REG(CAU_BASE_PTR,8)
#define CAU_DIRECT9                              CAU_DIRECT_REG(CAU_BASE_PTR,9)
#define CAU_DIRECT10                             CAU_DIRECT_REG(CAU_BASE_PTR,10)
#define CAU_DIRECT11                             CAU_DIRECT_REG(CAU_BASE_PTR,11)
#define CAU_DIRECT12                             CAU_DIRECT_REG(CAU_BASE_PTR,12)
#define CAU_DIRECT13                             CAU_DIRECT_REG(CAU_BASE_PTR,13)
#define CAU_DIRECT14                             CAU_DIRECT_REG(CAU_BASE_PTR,14)
#define CAU_DIRECT15                             CAU_DIRECT_REG(CAU_BASE_PTR,15)

/* CAU - Register array accessors */
#define CAU_DIRECT(index)                        CAU_DIRECT_REG(CAU_BASE_PTR,index)
#define CAU_LDR_CA(index)                        CAU_LDR_CA_REG(CAU_BASE_PTR,index)
#define CAU_STR_CA(index)                        CAU_STR_CA_REG(CAU_BASE_PTR,index)
#define CAU_ADR_CA(index)                        CAU_ADR_CA_REG(CAU_BASE_PTR,index)
#define CAU_RADR_CA(index)                       CAU_RADR_CA_REG(CAU_BASE_PTR,index)
#define CAU_XOR_CA(index)                        CAU_XOR_CA_REG(CAU_BASE_PTR,index)
#define CAU_ROTL_CA(index)                       CAU_ROTL_CA_REG(CAU_BASE_PTR,index)
#define CAU_AESC_CA(index)                       CAU_AESC_CA_REG(CAU_BASE_PTR,index)
#define CAU_AESIC_CA(index)                      CAU_AESIC_CA_REG(CAU_BASE_PTR,index)

/*! \} */ /* end of group CAU_Register_Accessor_Macros */


