jmestanza/labo-de-micros-tpf/audio/old_files/I2S+I2C(UDA1380)/old_files/Ejemplos/demo_i2s_2.x_for_release/demo_i2s/src/include/__MK60X256VMD100.h
/*! \} */ /* end of group RFSYS_Peripheral */


/* ----------------------------------------------------------------------------
   -- RFVBAT
   ---------------------------------------------------------------------------- */

/*! \addtogroup RFVBAT_Peripheral RFVBAT */
/*! \{ */

/*! RFVBAT - Peripheral register structure */
typedef struct RFVBAT_MemMap {
  uint32_t REG[8];                                 /*!< VBAT register file register, array offset: 0x0, array step: 0x4 */
} volatile *RFVBAT_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- RFVBAT - Register accessor macros
   ---------------------------------------------------------------------------- */

/*! \addtogroup RFVBAT_Register_Accessor_Macros RFVBAT - Register accessor macros */
/*! \{ */


/* RFVBAT - Register accessors */
#define RFVBAT_REG_REG(base,index)               ((base)->REG[index])

/*! \} */ /* end of group RFVBAT_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- RFVBAT Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup RFVBAT_Register_Masks RFVBAT Register Masks */
/*! \{ */

/* REG Bit Fields */
#define RFVBAT_REG_LL_MASK                       0xFFu
#define RFVBAT_REG_LL_SHIFT                      0
#define RFVBAT_REG_LL(x)                         (((uint32_t)(((uint32_t)(x))<<RFVBAT_REG_LL_SHIFT))&RFVBAT_REG_LL_MASK)
#define RFVBAT_REG_LH_MASK                       0xFF00u
#define RFVBAT_REG_LH_SHIFT                      8
#define RFVBAT_REG_LH(x)                         (((uint32_t)(((uint32_t)(x))<<RFVBAT_REG_LH_SHIFT))&RFVBAT_REG_LH_MASK)
#define RFVBAT_REG_HL_MASK                       0xFF0000u
#define RFVBAT_REG_HL_SHIFT                      16
#define RFVBAT_REG_HL(x)                         (((uint32_t)(((uint32_t)(x))<<RFVBAT_REG_HL_SHIFT))&RFVBAT_REG_HL_MASK)
#define RFVBAT_REG_HH_MASK                       0xFF000000u
#define RFVBAT_REG_HH_SHIFT                      24
#define RFVBAT_REG_HH(x)                         (((uint32_t)(((uint32_t)(x))<<RFVBAT_REG_HH_SHIFT))&RFVBAT_REG_HH_MASK)

/*! \} */ /* end of group RFVBAT_Register_Masks */


/* RFVBAT - Peripheral instance base addresses */
/*! Peripheral RFVBAT base pointer */
#define RFVBAT_BASE_PTR                          ((RFVBAT_MemMapPtr)0x4003E000u)

/* ----------------------------------------------------------------------------
   -- RFVBAT - Register accessor macros
   ---------------------------------------------------------------------------- */

/*! \addtogroup RFVBAT_Register_Accessor_Macros RFVBAT - Register accessor macros */
/*! \{ */


/* RFVBAT - Register instance definitions */
/* RFVBAT */
#define RFVBAT_REG0                              RFVBAT_REG_REG(RFVBAT_BASE_PTR,0)
#define RFVBAT_REG1                              RFVBAT_REG_REG(RFVBAT_BASE_PTR,1)
#define RFVBAT_REG2                              RFVBAT_REG_REG(RFVBAT_BASE_PTR,2)
#define RFVBAT_REG3                              RFVBAT_REG_REG(RFVBAT_BASE_PTR,3)
#define RFVBAT_REG4                              RFVBAT_REG_REG(RFVBAT_BASE_PTR,4)
#define RFVBAT_REG5                              RFVBAT_REG_REG(RFVBAT_BASE_PTR,5)
#define RFVBAT_REG6                              RFVBAT_REG_REG(RFVBAT_BASE_PTR,6)
#define RFVBAT_REG7                              RFVBAT_REG_REG(RFVBAT_BASE_PTR,7)

/* RFVBAT - Register array accessors */
#define RFVBAT_REG(index)                        RFVBAT_REG_REG(RFVBAT_BASE_PTR,index)

/*! \} */ /* end of group RFVBAT_Register_Accessor_Macros */


/*! \} */ /* end of group RFVBAT_Peripheral */


/* ----------------------------------------------------------------------------
   -- RNG
   ---------------------------------------------------------------------------- */

/*! \addtogroup RNG_Peripheral RNG */
/*! \{ */

/*! RNG - Peripheral register structure */
typedef struct RNG_MemMap {
  uint32_t VER;                                    /*!< RNGB Version ID Register, offset: 0x0 */
  uint32_t CMD;                                    /*!< RNGB Command Register, offset: 0x4 */
  uint32_t CR;                                     /*!< RNGB Control Register, offset: 0x8 */
  uint32_t SR;                                     /*!< RNGB Status Register, offset: 0xC */
  uint32_t ESR;                                    /*!< RNGB Error Status Register, offset: 0x10 */
  uint32_t OUT;                                    /*!< RNGB Output FIFO, offset: 0x14 */
} volatile *RNG_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- RNG - Register accessor macros
   ---------------------------------------------------------------------------- */

/*! \addtogroup RNG_Register_Accessor_Macros RNG - Register accessor macros */
/*! \{ */


/* RNG - Register accessors */
#define RNG_VER_REG(base)                        ((base)->VER)
#define RNG_CMD_REG(base)                        ((base)->CMD)
#define RNG_CR_REG(base)                         ((base)->CR)
#define RNG_SR_REG(base)                         ((base)->SR)
#define RNG_ESR_REG(base)                        ((base)->ESR)
#define RNG_OUT_REG(base)                        ((base)->OUT)

/*! \} */ /* end of group RNG_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- RNG Register Masks
   ---------------------------------------------------------------------------- */

/*! \addtogroup RNG_Register_Masks RNG Register Masks */
/*! \{ */

/* VER Bit Fields */
#define RNG_VER_MINOR_MASK                       0xFFu
#define RNG_VER_MINOR_SHIFT                      0
#define RNG_VER_MINOR(x)                         (((uint32_t)(((uint32_t)(x))<<RNG_VER_MINOR_SHIFT))&RNG_VER_MINOR_MASK)
#define RNG_VER_MAJOR_MASK                       0xFF00u
#define RNG_VER_MAJOR_SHIFT                      8
#define RNG_VER_MAJOR(x)                         (((uint32_t)(((uint32_t)(x))<<RNG_VER_MAJOR_SHIFT))&RNG_VER_MAJOR_MASK)
#define RNG_VER_TYPE_MASK                        0xF0000000u
#define RNG_VER_TYPE_SHIFT                       28
#define RNG_VER_TYPE(x)                          (((uint32_t)(((uint32_t)(x))<<RNG_VER_TYPE_SHIFT))&RNG_VER_TYPE_MASK)
/* CMD Bit Fields */
#define RNG_CMD_ST_MASK                          0x1u
#define RNG_CMD_ST_SHIFT                         0
#define RNG_CMD_GS_MASK                          0x2u
#define RNG_CMD_GS_SHIFT                         1
#define RNG_CMD_CI_MASK                          0x10u
#define RNG_CMD_CI_SHIFT                         4
#define RNG_CMD_CE_MASK                          0x20u
#define RNG_CMD_CE_SHIFT                         5
#define RNG_CMD_SR_MASK                          0x40u
#define RNG_CMD_SR_SHIFT                         6
/* CR Bit Fields */
#define RNG_CR_FUFMOD_MASK                       0x3u
#define RNG_CR_FUFMOD_SHIFT                      0
#define RNG_CR_FUFMOD(x)                         (((uint32_t)(((uint32_t)(x))<<RNG_CR_FUFMOD_SHIFT))&RNG_CR_FUFMOD_MASK)
#define RNG_CR_AR_MASK                           0x10u
#define RNG_CR_AR_SHIFT                          4
#define RNG_CR_MASKDONE_MASK                     0x20u
#define RNG_CR_MASKDONE_SHIFT                    5
#define RNG_CR_MASKERR_MASK                      0x40u
#define RNG_CR_MASKERR_SHIFT                     6
/* SR Bit Fields */
#define RNG_SR_BUSY_MASK                         0x2u
#define RNG_SR_BUSY_SHIFT                        1
#define RNG_SR_SLP_MASK                          0x4u
#define RNG_SR_SLP_SHIFT                         2
#define RNG_SR_RS_MASK                           0x8u
#define RNG_SR_RS_SHIFT                          3
#define RNG_SR_STDN_MASK                         0x10u
#define RNG_SR_STDN_SHIFT                        4
#define RNG_SR_SDN_MASK                          0x20u
#define RNG_SR_SDN_SHIFT                         5
#define RNG_SR_NSDN_MASK                         0x40u
#define RNG_SR_NSDN_SHIFT                        6
#define RNG_SR_FIFO_LVL_MASK                     0xF00u
#define RNG_SR_FIFO_LVL_SHIFT                    8
#define RNG_SR_FIFO_LVL(x)                       (((uint32_t)(((uint32_t)(x))<<RNG_SR_FIFO_LVL_SHIFT))&RNG_SR_FIFO_LVL_MASK)
#define RNG_SR_FIFO_SIZE_MASK                    0xF000u
#define RNG_SR_FIFO_SIZE_SHIFT                   12
#define RNG_SR_FIFO_SIZE(x)                      (((uint32_t)(((uint32_t)(x))<<RNG_SR_FIFO_SIZE_SHIFT))&RNG_SR_FIFO_SIZE_MASK)
#define RNG_SR_ERR_MASK                          0x10000u
#define RNG_SR_ERR_SHIFT                         16
#define RNG_SR_ST_PF_MASK                        0xE00000u
#define RNG_SR_ST_PF_SHIFT                       21
#define RNG_SR_ST_PF(x)                          (((uint32_t)(((uint32_t)(x))<<RNG_SR_ST_PF_SHIFT))&RNG_SR_ST_PF_MASK)
#define RNG_SR_STATPF_MASK                       0xFF000000u
#define RNG_SR_STATPF_SHIFT                      24
#define RNG_SR_STATPF(x)                         (((uint32_t)(((uint32_t)(x))<<RNG_SR_STATPF_SHIFT))&RNG_SR_STATPF_MASK)
/* ESR Bit Fields */
#define RNG_ESR_LFE_MASK                         0x1u
#define RNG_ESR_LFE_SHIFT                        0
#define RNG_ESR_OSCE_MASK                        0x2u
#define RNG_ESR_OSCE_SHIFT                       1
#define RNG_ESR_STE_MASK                         0x4u
#define RNG_ESR_STE_SHIFT                        2
#define RNG_ESR_SATE_MASK                        0x8u
#define RNG_ESR_SATE_SHIFT                       3
#define RNG_ESR_FUFE_MASK                        0x10u
#define RNG_ESR_FUFE_SHIFT                       4
/* OUT Bit Fields */
#define RNG_OUT_RANDOUT_MASK                     0xFFFFFFFFu
#define RNG_OUT_RANDOUT_SHIFT                    0
#define RNG_OUT_RANDOUT(x)                       (((uint32_t)(((uint32_t)(x))<<RNG_OUT_RANDOUT_SHIFT))&RNG_OUT_RANDOUT_MASK)

/*! \} */ /* end of group RNG_Register_Masks */


/* RNG - Peripheral instance base addresses */
/*! Peripheral RNG base pointer */
#define RNG_BASE_PTR                             ((RNG_MemMapPtr)0x400A0000u)

/* ----------------------------------------------------------------------------
   -- RNG - Register accessor macros
   ---------------------------------------------------------------------------- */

